/*
1) git init  ქმნის ახალ GIT რეპოზიტორიას იმ ფოლდერში, რომელშიც გაუშვებ

2) git add file/folder რეპოზიტორიაში გასაგზავნად ამზადებს ფაილებს

3) 1: working directory ჩვენი website ფოლდერი
   2: staging area მარშუტკა ჩვენი ფოდლერიდან რეპოზიტორიამდე
   3: repository ის ადგილი სადაც git-ი ჩვენს კოდს და მასზე განხორციელებული ცვლილებების ისტორიას ინახავს

   და ამ სამ ილუსტრაციაში არის მოყვანილი 2 ცალი ბრძანება  git add ჩვენს მიერი შექმნილი working directorydan შეცვლილ ფაილებს staging area -ში ანუ მარშუტკაში ჩასვამს და git commit დაძრავს ამ მარშუტკას და რეპოზიტორიამდე მიაგორებს

   git commit-ს ასევე უნდა დავუმატოთ  m ანუ git commit -m ""  m-ი ნიშნავს მესიჯს რომელშიც უნდა ჩავწეროთ ანუ რაზე ვიმუშავეთ კონკრეტულ კოდში და მომავალში როცა ამ კოდის პოვნა დაგვჭირდება ამ მესიჯის დახმარევბით მარტივად ვიპოვით

4) git status გეუბნება რა განსხვავებაა რეპოზიტორიასა და შენს ფაილებს შორის

*/
